# Center Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ellipse..::..Center Property
Ellipse Class See Also
---
Returns the center of the ellipse.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Center { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Center As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Center {
	XYZ^ get ();
}
```

# See Also
Ellipse Class
Autodesk.Revit.DB Namespace